{
  "welcome": "Hello, {name}!",
  "pages.auth.RegistrationTitle": "Registration",
  "pages.auth.SignInTitle": "Sign in",
  "baselayout.menuheader.GuestUsername": "GUEST",
  "Avatar": "Avatar",
  "SignIn": "Sign in",
  "SignOut": "Sign out",
  "Register": "Register",
  "Name": "Name",
  "Email": "Email",
  "Password": "Password",
  "Captcha": "Captcha",
  "ConfirmPassword": "Confirm password",
  "ServerError": "Server error",
  "StartRecovery": "Start recovery",
  "Started": "Started",
  "Loading": "Loading...",
  "PageUnavailable": "You are not authorized",
  "Change": "Change",
  "Changed": "Changed",
  "GoToLogin": "GoToLogin",
  "GoToSignIn": "GoToSignIn",
  "pages.auth.LoggedIn": "Logged in",
  "pages.auth.EmailIsNoFound": "Email is not found",
  "pages.auth.WrongPassword": "Wrong password",
  "pages.auth.PleaseInputYourEmail": "Please input your Email",
  "pages.auth.PleaseInputYourPassword": "Please input your Password",
  "pages.auth.ForgotPassword": "Forgot password?",
  "pages.auth.Registered": "Registered",
  "pages.auth.EmailIsAlreadyRegistered": "This email is already registered!",
  "pages.auth.WhatDoYouWantOthersToCallYou": "What do you want others to call you?",
  "pages.auth.PleaseInputYourName": "Please input your Name",
  "pages.auth.PleaseConfirmYourPassword": "Please confirm your password",
  "pages.auth.EmailIsNotValid": "The email has wrong format!",
  "pages.auth.PasswordIsTooShort": "The password is too short!",
  "pages.auth.ShouldAcceptAgreement": "You should accept the agreement",
  "pages.auth.TwoPasswordDontMatch": "The two passwords that you entered do not match!",
  "pages.auth.WeMustMakeSureThatYouAreHuman": "We must make sure that your are a human",
  "pages.auth.IHaveReadAndAcceptTheAgreement": "I have read and accept the agreement",
  "pages.auth.ForgotPasswordTitle": "Restore password",
  "pages.auth.IsNotImplementedYet": "Is not implemented yet ...",
  "pages.auth.EmailIsNotRegistered": "This email is not registered yet",
  "pages.auth.ForgotPasswordDescription": "You can change your password for security reasons or reset it if you forget it. You will get an email with the steps to recover your account password",
  "pages.auth.ForgotPasswordStartedDescription": "You successfully started the recovery process. Usually, it takes some time to deliver recovery instructions email. If you don’t get an email: check your Spam folder",
  "pages.auth.ChangePasswordTitle": "Change password",
  "pages.auth.PasswordWasChanged": "The password was changed",
  "pages.auth.PasswordWasChangedDescription": "You can use you new password to sign in",
  "logout": "Logout",
  "pages": {
    "index": {
      "title": "Welcome!",
      "apply_test": "Apply first DISC test."
    }
  },
  "tests": {
    "disc": [
      {
        "title": "Вы пришли в гости, где собралось уже более 10 человек. Ваша реакция:",
        "options": [
          "Здорово! Обожаю шумные компании, можно повеселиться, завести новых знакомых.",
          "Я люблю бывать в компаниях, часто оказываюсь в центре внимания. Или удастся хорошенько зажечь, или уж, на худой конец, с полезными людьми познакомлюсь.",
          "Надеюсь, что встречу здесь каких-нибудь знакомых, мне будет приятно с ними пообщаться. Если все – незнакомые люди, то мне будет некомфортно.",
          "Я не очень люблю шумные компании и хожу на вечеринки только, чтобы завести или поддержать полезные знакомства. Мне приятнее посидеть и поговорить с одним-двумя людьми в покое и тишине."
        ]
      },
      {
        "title": "На этой же вечеринке вас попросили произнести тост. Ваша реакция:",
        "options": [
          "Я не люблю привлекать к себе внимание, ненавижу произносить тосты. Я не буду ни соглашаться, ни отказываться, а просто как-нибудь увильну.",
          "Я хороший рассказчик и знаю пару прикольных тостов. Все будут в восторге.",
          "Я не боюсь произносить тосты, даже получаю от этого удовольствие, скажу что-нибудь умное и по делу.",
          "Я, скорее всего, откажусь под убедительным предлогом. Но если мне надо произвести хорошее впечатление для пользы дела, то могу и произнести уместный изящный тост."
        ]
      },
      {
        "title": "Ваш начальник дал вам и вашему сослуживцу задание, но не назначил ответственного за его выполнение. Вы оба понадеялись друг на друга и забыли про задание. Сейчас ваш начальник ругает вас за невыполнение задания. Ваша реакция:",
        "options": [
          "Негативные эмоции, которые никак не проявляются внешне. Я в состоянии контролировать себя, но теперь я знаю, чего можно ожидать от этих людей, буду осторожнее в работе с ними в будущем.",
          "Очень эмоциональная реакция, возможны слезы у девушки. Ну да, я – рассеянный и не очень пунктуальный человек, но не я один(одна) виноват(а). Буду жаловаться на них всем друзьям и знакомым.",
          "Обида на сослуживца. Как он мог так подставить меня! Обида на начальника. Я буду долго переживать из-за этого, скорее всего, молча.",
          "Злость на начальника, потому что он безграмотный руководитель, и/или на сослуживца, потому что он меня подставил. Всплеск агрессивных эмоций. Скорее всего, кому-нибудь из них что-нибудь выскажу."
        ]
      },
      {
        "title": "Вам дали важное задание. Срок выполнения – через месяц, а выполнить его можно за две недели. Ваша реакция:",
        "options": [
          "Лучше поскорее выполню задание и сдам его. И в глазах начальства буду хорошо выглядеть, и у меня время для других дел будет.",
          "Сначала мне надо подумать, как лучше всего подойти к выполнению этой работы. Даже если сделаю ее заранее, сразу сдавать не буду. Пусть отлежится, потом еще раз исправлю ошибки. Может, сдам работу за день до срока.",
          "Сразу возьмусь за дело. Но, скорее всего, мне быстро надоест эта работа, и я увлекусь другим заданием. Заброшу эту работу до тех пор, пока не наступит крайний срок. Потом срочно буду все доделывать, может, даже опоздаю со сдачей.",
          "Хотелось бы начать делать сразу, но знаю, что так не получится. Всегда есть более срочные или важные дела, все время что-то отвлекает. Скорее всего, буду выполнять задание до последней минуты."
        ]
      },
      {
        "title": "Впереди длинные выходные. Вы решили куда-нибудь выбраться. Что вы выберете:",
        "options": [
          "Съездить в гости к родственникам или иначе провести день с семьей, супругой(м).",
          "Сходить в парк или на вечеринку с друзьями.",
          "Съездить на картинг или поиграть в футбол (карты) с друзьями.",
          "Сходить на концерт или выставку, можно в одиночку или с близким человеком."
        ]
      },
      {
        "title": "Если бы Вы решили прыгать с парашютом, то по какой причине:",
        "options": [
          "Я познакомился с очень интересными людьми (человеком), которые занимаются парашютным спортом. Они меня уговорили присоединиться.",
          "Мне необходимо через это пройти для достижения важной для меня цели.",
          "Я вообще люблю риск, адреналин. Хочу узнать, на что я спосо",
          "Меня считают тихоней. Я всегда в тени, отмалчиваюсь. Хочу доказать себе и другим, что я не трус и не тряпка."
        ]
      },
      {
        "title": "Какие комментарии вы слышите чаще (как на работе, так и дома) в свой адрес:",
        "options": [
          "«А быстрее нельзя?» «Ты опять тянешь время!» «Сколько можно обсуждать одно и то же».",
          "«Пожалуйста, помедленнее». «Ты опять всех торопишь, мы никуда не опаздываем!» «Тебе уже все ясно, а мне – еще нет. Давай не торопясь все обсудим»."
        ]
      },
      {
        "title": "Вы узнали, что вас решили повысить по службе. Что вы сделаете прежде всего:",
        "options": [
          "Сообщите родным и близким о повышении, устроите уютный домашний праздник.",
          "Купите себе какую-нибудь дорогую вещь, чтобы в достойном виде прибыть на место работы в первый день на новой должности  (часы, костюм, машину).",
          "Поделитесь радостью с друзьями, закатите большую шумную вечеринку.",
          "Подождете радоваться, сорить деньгами и трезвонить о повышении пока не начнете работать на новом месте. Ведь еще даже приказ не подписан."
        ]
      },
      {
        "title": "9. У вас завтра экзамен. Ваше поведение:",
        "options": [
          "Лучше быстро повторить материал, чтобы осталось время на другие важные для вас дела.",
          "Лучше еще раз не спеша все повторить, пускай это даже займет всю ночь.",
          "Лучше хорошенько отоспаться перед экзаменом, чтобы прийти на него со свежей головой. К экзамену вы готовились заранее.",
          "Перед смертью не надышишься. Лучше вообще не думать об экзамене, а пойти повеселиться."
        ]
      },
      {
        "title": "Как вы считаете, что является главным для победы, для достижения успеха:",
        "options": [
          "Личные усилия каждого. Каждый человек должен отвечать за себя, выкладываться по максимуму, не прятаться за спинами других.",
          "Главное – командная работа, люди могут добиться чего-либо только вместе, помогая друг другу, поддерживая друг друга."
        ]
      },
      {
        "title": " Если бы вы решили открыть свой бизнес (успех и одинаковая прибыльность гарантированы), что бы вы выбрали (абстрагируйтесь от вашей профессии):",
        "options": [
          "Личные усилия каждого. Каждый человек должен отвечать за себя, выкладываться по максимуму, не прятаться за спинами других.",
          "Главное – командная работа, люди могут добиться чего-либо только вместе, помогая друг другу, поддерживая друг друга."
        ]
      },
      {
        "title": "Как вы считаете, что является главным для победы, для достижения успеха:",
        "options": [
          "Фирму финансового консалтинга или фирму по борьбе с вредными насекомыми.",
          "Охранную фирму или оружейный магазин.",
          "Ресторан или ночной клуб.",
          "Медицинский центр или бюро добрых услуг."
        ]
      },
      {
        "title": "У вас – новый просторный кабинет. Чем вы украсите его стены:",
        "options": [
          "Своими фото с известными людьми или яркими современными картинами.",
          "Фото супруга(и) и детей или групповыми фото ваших сослуживцев на корпоративе.",
          "Дипломами или нейтральными картинами.",
          "Портретом президента или старинной саблей."
        ]
      },
      {
        "title": " Что вы цените более всего в одежде?",
        "options": [
          "В одежде обязательно должна быть какая-нибудь изюминка, кураж.",
          "Одежда должна выглядеть дорого и круто.",
          "Одежда должна быть удобной.",
          "Одежда должна быть качественной и уместной, то есть соответствовать возрасту, фигуре и ситуации, в которой ее одеваешь."
        ]
      },
      {
        "title": "Вам надо выбрать соревнование, в котором вам комфортнее всего будет участвовать и где у вас больше шансов на победу. Что вы выберите?",
        "options": [
          "Индивидуальные соревнования, где оценивается сообразительность, а не быстрота реакции (шахматы, бильярд, покер).",
          "Индивидуальные соревнования на скорость и смелость (прыжки с парашютом, автогонки, горные лыжи).",
          "Командные соревнования, лучше какие-нибудь необычные (футбол в грязи, всякие корпоративные веселые старты).",
          "Командные соревнования, где требуется взаимная поддержка, взаимодействие всей команды (соревнование университетов по созданию лучшего робота, керлинг)."
        ]
      },
      {
        "title": "Вам надо выбрать гостиницу в Питере. Что вы выберете?",
        "options": [
          "Какую-нибудь приличную гостиницу в центре, чтобы не стыдно было.",
          "Какой-нибудь прикольный необычный мини-отель.",
          "Гостиницу, где раньше останавливался или которую порекомендуют знакомые.",
          "Гостиницу с идеальным соотношением цена/качество. Может быть, в старинном доме в ретро-стиле.."
        ]
      }
    ],
    "DataFetching": "Fetching test source..."
  }
}
